package studentManager;
/* 작업 하고 바로바로 테스트하고싶으면 이 경우엔 switch case 문이니까
 * break만 만들어놓고 완성할때마다 기능 추가하면 된디.
 *                                                                                                                                                                                                                                                                                           
 * subject부터 작업해보자.
 * 생성자에서 어떤 자료형으로 어떻게 받는지를 정해야 
 * 의미있는 이름으로 추천
 * 과목 정보 클래스 > 과목1개, 과목정보: 코드 이름 시수 강사명 강의장
 * 개인1명이 보기할때 어떤 과목을 보는지 같이 보여주기....
 * 
 */